local sMsg=[[.
!!!ПОДДЕРЖИ ХАБ СВОИМ ПРИСУТСТВИЕМ - НЕ ДАЙ УМЕРЕТЬ DC++ НА БИЛАЙНЕ, ТЕПЕРЬ УЖЕ В КАЗАХСТАНЕ!!!

Хаб лучшее место для тех у кого нету интернета и даже если он у тебя есть и ты часто бываешь на хабе ПОДДЕРЖИ нашу сеть своим присутствием, не уходи когда у тебя появляется доступ в интернет и не приходи когда у тебя его нету в начале месяца чтоб просить дать тебе прокси на час, а потом мерзко сваливать! По мере возможности заходи чаше, иначе какой смысл держать хаб для пару человек и таких как ты которые приходящие - 2 дня сьебвашиеся, тупо использующие хаб как однодневную блять?

Присутствуй хотя бы пару раз в неделю чтоб не дать полностью ЗАГНУТЬСЯ хабам на Билайне от не заинтересованности админов дальше ее поддерживать. Хабы умирают только и за отсутствия его посещения!
И да теперь уже хабов в Казахстане нету, кроме как наших 2х. У остальных провайдеров нету такой лок. сети как у ебалайна, по этому наш контингент исключительно аборигены хабов из числа постоянных, они и не дают полностью здохнуть серверу, рахметизация пацаны и лафки от админа.

Так как мой хаб работает круглосуточно 7 дней в неделю, без выключения больше чем на 2 минуты, это достигнуто за счет установки его в роутер, с ним и не дохнит мое хобби его держать.
Кому интресна эта тема вот Паблик хаба: https://vk.com/dchub_router 
Тема с фотографиями на форуме: http://dcbeelinekz.1bb.ru/viewtopic.php?id=95
Роутер это супер экономичный хостинг для DC сервера, единственный хаб, аналогов которого сейчас нету! 


ХАБ ВОДНИКА ИЗМЕНИЛ АДРЕС: dchub://beeline.vodnik.xyz ТЕПЕРЬ ОН СТАЛ ЕЩЕ КРАСИВЕЕ (ЗАХОДИТ БЕЗ ИНТЕРНЕТА)
 ПРОКСИ СЕРВЕР/ ТОРРЕНТ-ПОРТАЛ/ СЕРВЕР СS 1.6/ ОНЛАЙН-КИНОТЕАТР/ РЕТРАНСЛЯЦИЯ РАДИО
НА НОВОМ АДРЕСЕ http://beeline.vodnik.xyz МНОГО ИНТЕРЕСНОГО (РАБОТАЕТ БЕЗ ИНТЕРНЕТА)

Твой помощник по настройке и другой инфы: magnet:?xt=urn:tree:tiger:L4EJPCQQNVVHARMQU77FDSQNX5ZTOU32ZLWJTOA&xl=28235518&dn=!%D0%9B%D0%A3%D0%A7%D0%A8%D0%98%D0%99+FAQ+%D0%9F%D0%9E+%D0%A5%D0%90%D0%91%D0%90%D0%9C+DC%2B%2B+%5BDCBEELINEKZ%5D+Full.chm
Настроенный и лучший клиент для хабов: magnet:?xt=urn:tree:tiger:WY65AG7X5MURRKEX5BH2DIMGBCZT7OPY3MZYNAA&xl=19589044&dn=!%D0%91%D0%95%D0%A1%D0%9F%D0%9B%D0%90%D0%A2%D0%9D%D0%AB%D0%99+%D0%9B%D0%9E%D0%9A%D0%90%D0%9B%D0%AC%D0%9D%D0%AB%D0%99+%D0%A4%D0%90%D0%99%D0%9B%D0%9E%D0%9E%D0%91%D0%9C%D0%95%D0%9D%D0%9D%D0%98%D0%9A+BEELINE.rar
]]

function UserConnected(tUser)
  Core.SendPmToUser(tUser,"МАМИН_ДРУГ",sMsg)
end
RegConnected=UserConnected
OpConnected=UserConnected