local sBot = "DCBEELINEKZ"

local sMsg=[[	ЧАСТЫЕ ВОПРОСЫ
  
  
  СКАЧАЙ: magnet:?xt=urn:tree:tiger:L4EJPCQQNVVHARMQU77FDSQNX5ZTOU32ZLWJTOA&xl=28235518&dn=!%D0%9B%D0%A3%D0%A7%D0%A8%D0%98%D0%99+FAQ+%D0%9F%D0%9E+%D0%A5%D0%90%D0%91%D0%90%D0%9C+DC%2B%2B+%5BDCBEELINEKZ%5D+Full.chm
  НАСТРОЙКИ СО СКРИНШОТАМИ
 
 КАК РАСШАРИТЬ СВОИ ФАЙЛЫ
  Файл > Настройки > Шара, выберите папки, которые вы хотите расшарить.
  После того, как закончится хэширование файлов, они появятся в списке ваших файлов.
 
 КАК ПОСМОТРЕТЬ СВОЮ ШАРУ
  Файл > Открыть свой список файлов. Или комбинация клавиш CTRL+SHIFT+L

 КУДА СКАЧИВАЮТСЯ ФАЙЛЫ
  Файл > Папка для скачивания
  Файл > Настройки > Скачивание, в поле Папка для скачиваний по умолчанию 


 КАК ОТМЕНИТЬ СКАЧИВАНИЕ
  Для отмены загрузки файла не достаточно простого нажатия в нижнем
  окне и выборе в меню [Закрыть соединение] Открываем Очередь скачивания,
  через панель Передачи > Очередь скачивания или нажатием CTRL+D,
  по файлу пр.мышью [Удалить] или поставить Установить приоритет > [Пауза]


 КАК ОБНОВИТЬ СВОЙ СПИСОК ФАЙЛОВ
  По мне, в чате вбить команду /refresh, и [Enter] 
  Или: 
  Файл > Обновить свой список файлов, либо зажать CTRL+E.
  Когда в нижнем правом углу процесс хеширования завершиться
  Затем: 
  Файл > Очистить базу данных ТТН от "мертвых" записей.
  Это для того чтобы не презаходить на хаб!


 КАК ПОЛЬЗОВАТЬСЯ ПОИСКОМ
  Зажать Ctrl + S (или значок с простой лупой), или выбрать Вид > Поиск,
  вбить в Поиск...то, что хотите найти, и нажать на [Поиск] 
  Обратите внимание на строчку [Тип файла]. Если вы ищете, например,
  фильм, то указывайте, что вам нужен именно Видео это облегчает поиск.
  Маленький секрет. Поиск иногда помогает ускорить возобновление прерванной скачки.
  Если прерванная скачка не продолжается автоматически
  (хотя все условия есть: источник, расшаренный файл и т.п.),
  нужно набрать имя скачиваемого файла (или часть имени) в Поиске и нажать [Enter].
  Скачка должна продолжиться.
  

 КАК СДЕЛАТЬ ССЫЛКУ НА ФАЙЛ (МАГНЕТ-ССЫЛКА)
  Необходимо открыть ваш список файлов Файл > Открыть свой список файлов, 
  либо зажать CTRL+SHIFT+L, выбрать необходимую папку где хранятся ваши файлы,
  и на необходимом файле(или файлах, при удержание CTRL, более актуально для сериалов, 
  чтобы не выбирать по одному файлу) Пр.мышки Копировать > Копировать магнет-ссылку,
  после чего, смело вставляем содержимое из буфера обмена.

--------------------------------------------------------------------
http://DCBEELINEKZ.1bb.ru МОРЕ ИНФОРМАЦИИ
http://DCBEELINEKZ.do.am САЙТ БИЛАЙН ХАБЫ КАЗАХСТАН
]]
------------------------------------------------------------------------------------------------
local sMsg2 = [[	ОСНОВНЫЕ КОМАНДЫ
 
 
  +myip - Твой IP
  /clear - Отчистить главный чат
  /close - закрытие активного окна
  /help - Вывести список встроенных в DC команд
  /flylinkdc++ - Информация о DC и ссылка где можно скачать DC++
  /fav или /favorite - Добавить активный хаб в избраное.
  /removefavorite - Удалить активный хаб из списка избранных
  /w или /winamp - Отображает какая у вас сейчас песня играет в винампе
  /refresh - Обновить ваш список файлов
  /rebuild - Перехэшировать файлы, то есть переделать шаринг заново
  /connection - Показать ваш IP адрес и порты, которые использует DC для работы

 ГОРЯЧИЕ КЛАВИШИ

  Ctrl + 1 - Включить/выключить панель управления
  Ctrl + 2 - Включить/выключить статусную строку
  Ctrl + 3 - Включить/выключить панель передачи файлов
  Ctrl + C - Копировать выделенный текст
  Ctrl + D - Открыть список файлов в очереди
  Ctrl + E - Обновить ваш список файлов
  Ctrl + F - Открыть избранные хабы.
  Ctrl + N - Открыть блокнот
  Ctrl + L - Открыть список файлов
  Ctrl + P - Открыть публичные хабы
  Ctrl + Q - Быстрое подключение к хабу
  Ctrl + R - Переподелючиться к хабу
  Ctrl + S - Открыть поиск
  Ctrl + T - Следовать последнему перенаправлению
  Ctrl + U - Открыть список избранных пользователей
  Ctrl + V - Вставить скопированный текст
  Ctrl + X - Вырезать выделенный текст

--------------------------------------------------------------------
http://DCBEELINEKZ.1bb.ru МОРЕ ИНФОРМАЦИИ
http://DCBEELINEKZ.do.am САЙТ БИЛАЙН ХАБЫ КАЗАХСТАН
]]
------------------------------------------------------------------------------------------------
local sMsg3 = [[	НЕ ЗАХОДИТ НИКОМУ В СПИСОК ФАЙЛОВ И НЕ РАБОТАЕТ ПОИСК
ОШИБКА - ТАЙМАУТ СОЕДИНЕНИЯ 

– Вам необходимо усвоить самое главное:
1. источник проблемы находится на Вашей стороне;
2. источник проблемы общий для обоих случаев. 

Пояснить «самое главное» можно следующим образом.

1. DC-Хаб, к которому Вы подключаетесь, никак не влияет на Вашу возможность скачивания и поиска файлов у других пользователей (за исключением редких нюансов). 
Часто можно увидеть заявления пользователей вида: «у меня вчера файлы скачивались и поиск работал, а сегодня всё не работает! Админы, разберитесь!» Администрация DC-Хаба в таком случае направляет на истинный путь: «ищите и устраняйте проблему на своей стороне: в своём компьютере или роутере».

2. Невозможность скачивания файлов и невозможность организации поиска в DC-Хабе имеют один (или более) общий источник проблемы. То есть если у Вас скачиваются файлы, но не работает поиск (или наоборот) – где-то что-то настроено, но не до конца. Что-то упущено из виду.

	РОУТЕР (ОСНОВНАЯ ПРОБЛЕМА СО СКАЧИВАНИЕМ НА ХАБЕ)
Роутер (белая коробочка), вам необходимо настроить переадресацию портов. Это связанно с тем, что прямой доступ в Интернет имеет сам роутер, позволяя компьютерам и устройствам внутренней домашней сети пользоваться своим соединением. Поэтому «снаружи» «видно» только роутер. Чтобы получить из внешнего мира доступ к сервисам внутренней сети (в нашем случае к DC-клиенту FlyLink) нужно, чтобы роутер переадресовывал IP-пакеты на нужный внутренний адрес и порт. Это и называется переадресацией портов или портфорвардингом.
 Для того чтобы посмотреть как настроить роутер, введите в чате команду: !router

	ЕСЛИ У ВАС НЕТУ РОУТЕРА
Вторая причина проблем с клиентом DC++ это брандмауэр Windows и фарволл

Программные средства защиты компьютера, в частности Kaspersky Internet Security, Eset Smart Security и прочие. Проблема решается путем добавления клиента DC++ в доверенные приложения firewall-а, а также снижением уровня защиты до среднего и ниже.
А так же Бранмауэр Windows блокирует клиент, его можно отключить либо добавить программу в исключение.

	АКТИВИНЫЙ И ПАССИВНЫЙ РЕЖИМЫ
Активный и Пассивный режимы это два разных вида подключения которые определяют, как вы будете подключатся к другим пользователям и порядок получения файлов. Пассивный режим это наиболее простой в использовании и должен работать практически в любых условиях. Но за простоту приходится платить.
Пассивный режим имеет ограничения при соединении (пассивные пользователи не могут подключатся к другим пассивным) и также вызывает дополнительную нагрузку на хаб, так как все связи пассивного режима идут через хаб. 
Это режим должен использоваться только когда невозможно использовать активный.

	НЕДОСТАТКИ ПАССИВНОГО РЕЖИМА
Пользователь в "Пассивном режиме" не может скачивать файлы с другого пользователя, находящегося тоже в "пассивном режиме". Пользователей в пассивном режиме на хабе в среднем 1/3, поэтому ВЫ теряете 33% источников если находитесь в ПАССИВНОМ режиме!
Падение скорости у пользователей в режиме "Пассив" гораздо сильнее (в sp2). В конце обычно приводит к разрыву связи и потере слота.
При поиске ответы от юзеров в пассивном режиме проходят через хаб, в активном - идут напрямую. Хаб не транслирует ответы с неполными источниками (если файл не докачан), поэтому, при появлении нового файла (фильма), активный юзер увидит много источников для скачки (всех, кто подключился к скачке и что-то успел скачать), а пассивный - только тех, кто скачал файл полностью и расшарил.
"Пассивов" можно узнать по кирпичной стене напротив ника в списке пользователей: 
--------------------------------------------------------------------
http://DCBEELINEKZ.1bb.ru МОРЕ ИНФОРМАЦИИ
http://DCBEELINEKZ.do.am САЙТ БИЛАЙН ХАБЫ КАЗАХСТАН
]]
------------------------------------------------------------------------------------------------
local sMsg4 = [[	СПИСОК  ХАБОВ. НА 2018
  ВСЕГДА СВЕЖИЙ СПИСОК ТУТ:
 http://dcbeelinekz.do.am/hubs.html

1. dchub://10.18.50.50:50 Резервный хаб основного: dchub://10.18.50.16
2. dchub://beeline.vodnik.xyz:411 вкл


--------------------------------------------------------------------
http://DCBEELINEKZ.1bb.ru МОРЕ ИНФОРМАЦИИ
http://DCBEELINEKZ.do.am САЙТ БИЛАЙН ХАБЫ КАЗАХСТАН
]]
------------------------------------------------------------------------------------------------
local sMsg5 = [[  
.   Прокси-сервер для пользователей
.   Адрес:  10.24.9.x  Порт: 3128 (Адрес на хабе dchub://beeline.vodnik.xyz:411 )
.   Бесплатный:  1 МБит/сек.
.   Платный:  от 4 до 8 МБит/сек.
.   Стоимость платного:  500 тг.

 ТАК ЖЕ НАСКАНЕННЫЕ ПРОКСИ СЕРВЕРЫ ЮЗЕРАМИ ХАБА:
 magnet:?xt=urn:tree:tiger:HDIRP2A343LGXW26WDJQQFAJQMCDNBWZFQYMCYQ&xl=732890&dn=!+%D0%A1%D0%9A%D0%90%D0%9D%D0%95%D0%A0+%D0%9F%D0%A0%D0%9E%D0%9A%D0%A1%D0%98+2017+%5BDCBEELINEKZ%5D.rar

 10.50.18.хх 3128 (ЧАСТО РАБОТАЕТ ВЕЧЕРОМ)

 ДЛЯ РАБОТЫ С ПРОКСИ
Можно использовать наш Proxifier для Билайн, скачать можно у админа ашаре, либо спросить в чате, я скину.
]]
------------------------------------------------------------------------------------------------
local sMsg6 = [[	НАСТРОЙКА РОУТЕРА (В КАРТИНКАХ http://dcbeelinekz.1bb.ru/pages/nastroika_routera_dlya_dc )

Если у вас роутер (белая коробочка), вам необходимо настроить переадресацию портов. Это связанно с тем, что прямой доступ в Интернет имеет сам роутер, позволяя компьютерам и устройствам внутренней домашней сети пользоваться своим соединением. Поэтому «снаружи» «видно» только роутер. Чтобы получить из внешнего мира доступ к сервисам внутренней сети (в нашем случае к DC-клиенту FlyLink) нужно, чтобы роутер переадресовывал IP-пакеты на нужный внутренний адрес и порт. Это и называется переадресацией портов или портфорвардингом.

Для Flylink DС++ такими например портами будут на моем примере: TCP и UDP 3333

Поскольку производителей роутеров много, и интерфейс своих роутеров производители делают по разному, для каждой конкретной модели (семейству моделей) порядок действий может отличаться. Он может называться: port mapping, virtual servers (Виртуальные серверы) или другими синонимами. Не важно как они называются, все они используют один принцип. Так что, здесь приведена настройка из самых популярных фирм роутеров Tp-Link.

	Зайдите на web-интерфейс роутера с помощью браузера!
В адресной строке введите 192.168.0.1 , Появится запрос логин\пароль на роутер; по-умолчанию admin\admin

Заходим в настройки роутера – 
вкладка Forwarding - Virtual Servers (Переадресация - Виртуальные серверы)

Нажимаем “Add New (Добавить)” Вводим данные:

Порт сервиса: Service Port: 3333 (порт на ваш выбор, главное чтобы он не был занят)
IP адрес: Ip addess: внутренний Ip вашего компьютера (мой 192.168.0.100) 
Как узнать свой IP, смотрите ниже!
Протокол: Protocol: All (Все)
Состояние: Status: Enable (Включено)


	Настраиваем клиент DC++ : открываем клиент (FlylinkDC++ , Strong DC++). 

Нажимаем "Файл", затем "Настройки" - вкладка "Настройки соединения".


Раздел "Настройка ВХОДЯЩИХ соединений :"
• Поставим переключатель в положение "Брандмауэр с ручным перенаправлением портов". 
• В поле "Внешний/WAN IP" указываем свой локальный адрес в сети провайдера (10.хх.хх.хх) 
Как узнать свой IP WAN, смотрите ниже!

• Справа в окнах "Порты" - в TCP и UDP вписываем соответственно 3333 и 3333

В пункте «Сетевой интерфейс для всех сетевых подключений», укажите ваш локальный ip-адрес, который выдает роутер вашему компьютеру, можно просто все 0.0.0.0

ВСЕ ГОТОВО! 
ПРОВЕРЯЕМ ЗАЙТИ К ПОЛЬЗОВАТЕЛЯМ, ЕСЛИ ВСЕ СДЕЛАЛИ ПРАВИЛЬНО И НЕ ОШИБЛИСЬ С IP, ТО ВСЕ БУДЕТ РАБОТАТЬ СРАЗУ, ЛИБО  ПОСЛЕ ПЕРЕЗАПУСКА ПРОГРАММЫ ИЛИ ПЕРЕЗАГРУЗКИ РОУТЕРА.

	КАК УЗНАТЬ ВАШ IP. 

Вариант 1. Зайдите в Привязка IP- и MAC -адресов  - Таблица ARP
Тут увидите подключение к роутеру по LAN или Wi-Fi, ваш IP можно по определить по MACу компьютера либо он будет единственный в списке в таблице...

Вариант 2. Зажимаем Win+R. В открывшемся окне вписываем команду cmd и жмём ОK
Откроется новое окно, вписываем там команду ipconfig . Увидите IP4 адрес, он начинается на 192.168....

	КАК УЗНАТЬ ВАШ IP (WAN)

Зайдите в настройки роутера:	
В Сеть - WAN, IP - адрес: (Этот IP ваш, виден в локальной сети Билайна)

--------------------------------------------------------------------
http://DCBEELINEKZ.1bb.ru МОРЕ ИНФОРМАЦИИ
http://DCBEELINEKZ.do.am САЙТ БИЛАЙН ХАБЫ КАЗАХСТАН
]]
------------------------------------------------------------------------------------------------

function UserConnected(tUser)
  Core.SendToUser(tUser,"$UserCommand 1 3 ТЕХ.ПОДДЕРЖКА\\ ЧАСТЫЕ ВОПРОСЫ$<%[mynick]> !vop&#124;")
  Core.SendToUser(tUser,"$UserCommand 1 3 ТЕХ.ПОДДЕРЖКА\\ ОСНОВНЫЕ КОМАНДЫ$<%[mynick]> !kom&#124;")
  Core.SendToUser(tUser,"$UserCommand 1 3 ТЕХ.ПОДДЕРЖКА\\ ЕСЛИ НЕ КАЧАЕТ$<%[mynick]> !prob&#124;")
  Core.SendToUser(tUser,"$UserCommand 1 3 ТЕХ.ПОДДЕРЖКА\\ СПИСОК ХАБОВ$<%[mynick]> !hubs&#124;")
  Core.SendToUser(tUser,"$UserCommand 1 3 ТЕХ.ПОДДЕРЖКА\\ ПРОКСИ$<%[mynick]> !proxy&#124;")
  Core.SendToUser(tUser,"$UserCommand 1 3 ТЕХ.ПОДДЕРЖКА\\ НАСТРОЙКА РОУТЕРА$<%[mynick]> !router&#124;")
end
RegConnected=UserConnected
OpConnected=UserConnected
function ChatArrival(tUser,sData)
  sData=sData:sub(tUser.sNick:len()+4,-2)
  if sData=="!vop" then
    Core.SendPmToUser(tUser,sBot,sMsg)
    return true
  elseif sData=="!kom" then
    Core.SendPmToUser(tUser,sBot,sMsg2)
    return true
  elseif sData=="!prob" then
    Core.SendPmToUser(tUser,sBot,sMsg3)
    return true
  elseif sData=="!hubs" then
    Core.SendPmToUser(tUser,sBot,sMsg4)
    return true
  elseif sData=="!proxy" then
    Core.SendPmToUser(tUser,sBot,sMsg5)
    return true
  elseif sData=="!router" then
    Core.SendPmToUser(tUser,sBot,sMsg6)
    return true
  end
end